#Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех случайных слов,
#взятых из трёх списков (по одному из каждого):
#nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
#adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
#adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
#        	Например:
#>>> get_jokes(2)
#["лес завтра зеленый", "город вчера веселый"]

from random import choice

def get_jokes(x):
    nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
    adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
    adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
    jokes = []
    for i in range(x):
        jokes.append(f'{choice(nouns)}  {choice(adverbs)}  {choice(adjectives)}')
    return jokes

print(get_jokes(2))